CSI API ETABS v1
cSpandrelLabel.GetSectionProperties Method
 Retrieves the section properties for a specified spandrel
 Namespace: ETABSv1
 Assembly: ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (2.6.0.0)
Syntax
int GetSectionProperties(
	string Name,
	ref int NumberStories,
	ref string[] StoryName,
	ref int[] NumAreaObj,
	ref int[] NumLineObj,
	ref double[] Length,
	ref double[] DepthLeft,
	ref double[] ThickLeft,
	ref double[] DepthRight,
	ref double[] ThickRight,
	ref string[] MatProp,
	ref double[] CGLeftX,
	ref double[] CGLeftY,
	ref double[] CGLeftZ,
	ref double[] CGRightX,
	ref double[] CGRightY,
	ref double[] CGRightZ
)
Function GetSectionProperties (
	Name As String,
	ByRef NumberStories As Integer,
	ByRef StoryName As String(),
	ByRef NumAreaObj As Integer(),
	ByRef NumLineObj As Integer(),
	ByRef Length As Double(),
	ByRef DepthLeft As Double(),
	ByRef ThickLeft As Double(),
	ByRef DepthRight As Double(),
	ByRef ThickRight As Double(),
	ByRef MatProp As String(),
	ByRef CGLeftX As Double(),
	ByRef CGLeftY As Double(),
	ByRef CGLeftZ As Double(),
	ByRef CGRightX As Double(),
	ByRef CGRightY As Double(),
	ByRef CGRightZ As Double()
) As Integer
Dim instance As cSpandrelLabel
Dim Name As String
Dim NumberStories As Integer
Dim StoryName As String()
Dim NumAreaObj As Integer()
Dim NumLineObj As Integer()
Dim Length As Double()
Dim DepthLeft As Double()
Dim ThickLeft As Double()
Dim DepthRight As Double()
Dim ThickRight As Double()
Dim MatProp As String()
Dim CGLeftX As Double()
Dim CGLeftY As Double()
Dim CGLeftZ As Double()
Dim CGRightX As Double()
Dim CGRightY As Double()
Dim CGRightZ As Double()
Dim returnValue As Integer
returnValue = instance.GetSectionProperties(Name,
	NumberStories, StoryName, NumAreaObj,
	NumLineObj, Length, DepthLeft, ThickLeft,
	DepthRight, ThickRight, MatProp,
	CGLeftX, CGLeftY, CGLeftZ, CGRightX,
	CGRightY, CGRightZ)
int GetSectionProperties(
	String^ Name,
	int% NumberStories,
	array<String^>^% StoryName,
	array<int>^% NumAreaObj,
	array<int>^% NumLineObj,
	array<double>^% Length,
	array<double>^% DepthLeft,
	array<double>^% ThickLeft,
	array<double>^% DepthRight,
	array<double>^% ThickRight,
	array<String^>^% MatProp,
	array<double>^% CGLeftX,
	array<double>^% CGLeftY,
	array<double>^% CGLeftZ,
	array<double>^% CGRightX,
	array<double>^% CGRightY,
	array<double>^% CGRightZ
)
abstract GetSectionProperties :
        Name : string *
        NumberStories : int byref *
        StoryName : string[] byref *
        NumAreaObj : int[] byref *
        NumLineObj : int[] byref *
        Length : float[] byref *
        DepthLeft : float[] byref *
        ThickLeft : float[] byref *
        DepthRight : float[] byref *
        ThickRight : float[] byref *
        MatProp : string[] byref *
        CGLeftX : float[] byref *
        CGLeftY : float[] byref *
        CGLeftZ : float[] byref *
        CGRightX : float[] byref *
        CGRightY : float[] byref *
        CGRightZ : float[] byref -> int
Parameters
Name
Type: System.String
 The name of an existing spandrel
NumberStories
Type: System.Int32
 The number of stories that the spandrel exists on and for which section properties are provided
StoryName
Type: System.String[]
 This is an array that includes the story names at which the spandrel exists
NumAreaObj
Type: System.Int32[]
 This is an array that includes the number of area objects in the spandrel at each story
NumLineObj
Type: System.Int32[]
 This is an array that includes the number of line objects in the spandrel at each story
Length
Type: System.Double[]
 This is an array that includes the spandrel length
DepthLeft
Type: System.Double[]
 This is an array that includes the spandrel depth at the left end
ThickLeft
Type: System.Double[]
 This is an array that includes the spandrel thickness at the left end
DepthRight
Type: System.Double[]
 This is an array that includes the spandrel depth at the right end
ThickRight
Type: System.Double[]
 This is an array that includes the spandrel thickness at the right end
MatProp
Type: System.String[]
 This is an array that includes the pier material property
CGLeftX
Type: System.Double[]
 This is an array that includes the x-coordinate of the center of gravity at the left end of the spandrel
CGLeftY
Type: System.Double[]
 This is an array that includes the y-coordinate of the center of gravity at the left end of the spandrel
CGLeftZ
Type: System.Double[]
 This is an array that includes the z-coordinate of the center of gravity at the left end of the spandrel
CGRightX
Type: System.Double[]
 This is an array that includes the x-coordinate of the center of gravity at the right end of the spandrel
CGRightY
Type: System.Double[]
 This is an array that includes the y-coordinate of the center of gravity at the right end of the spandrel
CGRightZ
Type: System.Double[]
 This is an array that includes the z-coordinate of the center of gravity at the right end of the spandrel
Return Value
Type: Int32
 Returns zero if the data is successfully retrieved; otherwise it returns a nonzero value
See Also
Reference
cSpandrelLabel Interface
ETABSv1 Namespace